In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['corey@gmail.com', 'jane@gmail.com', 'jhon@gmail.com']
}

In [2]:
import pandas as pd
pd.set_option('display.max_columns', 85)

In [3]:
df = pd.DataFrame(people)

In [4]:
df.set_index('email', inplace=True)

In [5]:
df

                 first     last
email
corey@gmail.com  Corey  Schafer
jane@gmail.com    Jane      Doe
jhon@gmail.com    John      Doe

In [6]:
df.loc["corey@gmail.com"]

first      Corey
last     Schafer
Name: corey@gmail.com, dtype: object

In [7]:
df.iloc[0]

first      Corey
last     Schafer
Name: corey@gmail.com, dtype: object

In [8]:
df.reset_index(inplace=True)

In [9]:
df

             email  first     last
0  corey@gmail.com  Corey  Schafer
1   jane@gmail.com   Jane      Doe
2   jhon@gmail.com   John      Doe

In [10]:
filtered = (df['last'] == "Schafer") | (df['first'] == "Jane")

In [11]:
df.loc[filtered, 'email']

0    corey@gmail.com
1     jane@gmail.com
Name: email, dtype: object

In [12]:
df.loc[~filtered, 'email']  # ~ means not

2    jhon@gmail.com
Name: email, dtype: object

In [13]:
df.columns = [ "email", "last_name", "first_name"]
df

             email last_name first_name
0  corey@gmail.com     Corey    Schafer
1   jane@gmail.com      Jane        Doe
2   jhon@gmail.com      John        Doe

In [14]:
df.columns = [x.upper() for x in df.columns]
df

             EMAIL LAST_NAME FIRST_NAME
0  corey@gmail.com     Corey    Schafer
1   jane@gmail.com      Jane        Doe
2   jhon@gmail.com      John        Doe

In [15]:
df.rename(columns={"LAST_NAME": "last_name", "FIRST_NAME": "first_name", "EMAIL":"email"}, inplace=True)
df

             email last_name first_name
0  corey@gmail.com     Corey    Schafer
1   jane@gmail.com      Jane        Doe
2   jhon@gmail.com      John        Doe

In [16]:
df.loc[2, ["last_name", "first_name"]] = ["Does", "Johns"]
df

             email last_name first_name
0  corey@gmail.com     Corey    Schafer
1   jane@gmail.com      Jane        Doe
2   jhon@gmail.com      Does      Johns

In [17]:
df["email"].apply(len)

0    15
1    14
2    14
Name: email, dtype: int64

In [18]:
def update_email(email):
    return email.upper()

In [19]:
df["email"].apply(update_email)

0    COREY@GMAIL.COM
1     JANE@GMAIL.COM
2     JHON@GMAIL.COM
Name: email, dtype: object

In [20]:
df["email"] = df["email"].apply(update_email)
df

             email last_name first_name
0  COREY@GMAIL.COM     Corey    Schafer
1   JANE@GMAIL.COM      Jane        Doe
2   JHON@GMAIL.COM      Does      Johns

In [21]:
df["email"] = df["email"].apply(lambda x: x.lower())
df

             email last_name first_name
0  corey@gmail.com     Corey    Schafer
1   jane@gmail.com      Jane        Doe
2   jhon@gmail.com      Does      Johns

In [22]:
df.apply(pd.Series.min)

email         corey@gmail.com
last_name               Corey
first_name                Doe
dtype: object

In [23]:
df.applymap(len)

   email  last_name  first_name
0     15          5           7
1     14          4           3
2     14          4           5

In [24]:
df.applymap(str.lower)

             email last_name first_name
0  corey@gmail.com     corey    schafer
1   jane@gmail.com      jane        doe
2   jhon@gmail.com      does      johns

In [25]:
df["last_name"].map({"Corey": "Chris", "Jane": "Mary"})

0    Chris
1     Mary
2      NaN
Name: last_name, dtype: object

In [26]:
df["last_name"] = df["last_name"].replace({"Corey": "Chris", "Jane": "Mary"})
df

             email last_name first_name
0  corey@gmail.com     Chris    Schafer
1   jane@gmail.com      Mary        Doe
2   jhon@gmail.com      Does      Johns

In [27]:
df["first_name"] + " " + df["last_name"]

0    Schafer Chris
1         Doe Mary
2       Johns Does
dtype: object

In [28]:
df["full_name"] = df["first_name"] + " " + df["last_name"]
df

             email last_name first_name      full_name
0  corey@gmail.com     Chris    Schafer  Schafer Chris
1   jane@gmail.com      Mary        Doe       Doe Mary
2   jhon@gmail.com      Does      Johns     Johns Does

In [29]:
df.drop(columns=["first_name", "last_name"], inplace=True)

In [30]:
df

             email      full_name
0  corey@gmail.com  Schafer Chris
1   jane@gmail.com       Doe Mary
2   jhon@gmail.com     Johns Does

In [31]:
df["full_name"].str.split(" ", expand=True)

         0      1
0  Schafer  Chris
1      Doe   Mary
2    Johns   Does

In [32]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)
df

             email      full_name    first   last
0  corey@gmail.com  Schafer Chris  Schafer  Chris
1   jane@gmail.com       Doe Mary      Doe   Mary
2   jhon@gmail.com     Johns Does    Johns   Does

In [33]:
df.append({"first": "Tony"}, ignore_index=True)

             email      full_name    first   last
0  corey@gmail.com  Schafer Chris  Schafer  Chris
1   jane@gmail.com       Doe Mary      Doe   Mary
2   jhon@gmail.com     Johns Does    Johns   Does
3              NaN            NaN     Tony    NaN

In [34]:
people = {
    "first" : ["Tony", "Steve"],
    "last" : ["Stark", "Rogers"],
    "email" : ["IronMan@mail.com", "captain@avange.com"]
}

df2 = pd.DataFrame(people)
df2

   first    last               email
0   Tony   Stark    IronMan@mail.com
1  Steve  Rogers  captain@avange.com

In [35]:
df.append(df2, ignore_index=True)

                email      full_name    first    last
0     corey@gmail.com  Schafer Chris  Schafer   Chris
1      jane@gmail.com       Doe Mary      Doe    Mary
2      jhon@gmail.com     Johns Does    Johns    Does
3    IronMan@mail.com            NaN     Tony   Stark
4  captain@avange.com            NaN    Steve  Rogers

In [36]:
df = df.append(df2, ignore_index=True)

In [37]:
df.drop(index=4)

              email      full_name    first   last
0   corey@gmail.com  Schafer Chris  Schafer  Chris
1    jane@gmail.com       Doe Mary      Doe   Mary
2    jhon@gmail.com     Johns Does    Johns   Does
3  IronMan@mail.com            NaN     Tony  Stark

In [38]:
filt = df["first"] == "Doe"
df.drop(index=df[filt].index)

                email      full_name    first    last
0     corey@gmail.com  Schafer Chris  Schafer   Chris
2      jhon@gmail.com     Johns Does    Johns    Does
3    IronMan@mail.com            NaN     Tony   Stark
4  captain@avange.com            NaN    Steve  Rogers

In [39]:
df

                email      full_name    first    last
0     corey@gmail.com  Schafer Chris  Schafer   Chris
1      jane@gmail.com       Doe Mary      Doe    Mary
2      jhon@gmail.com     Johns Does    Johns    Does
3    IronMan@mail.com            NaN     Tony   Stark
4  captain@avange.com            NaN    Steve  Rogers